Revit 2026 API

# AdvancedOpaqueOpaqueLuminance Property

---

The property labeled "Emissive Luminance" from the "AdvancedOpaque" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string OpaqueLuminance { get; }
```
```vb
Public Shared ReadOnly Property OpaqueLuminance As String
	Get
```
```cpp
public:
static property String^ OpaqueLuminance {
	String^ get ();
}
```
```fsharp
static member OpaqueLuminance : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedOpaque Class

Autodesk.Revit.DB.Visual Namespace